Tekla Open API Reference for Tekla Structures 2025
Frame Methods
The Frame type exposes the following members.
Methods
Name | Description
Clone
 Clones the object.
GetAxisAlignedBoundingBox
 Returns the bounding box of the frame in the global axis coordinate system.
GetObjectAlignedBoundingBox
 Returns the bounding box of the frame in the local coordinate system.
IsEqual
 Compares the current object with an object of the same type.
Top
See Also
Reference
Frame Class
Tekla.Structures.Drawing Namespace